//=============================================================================
// 
//  クリアランクヘッダー [clearrank.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _GLASSCLUSH_H_
#define _GLASSCLUSH_H_	// 二重インクルード防止

#include "object2d.h"
#include "judge.h"

//==========================================================================
// クラス定義
//==========================================================================
// クリアランククラス
class CClearRank : public CObject2D
{
public:

	//=============================
	// 状態列挙
	//=============================
	enum State
	{
		STATE_NONE = 0,		// なにもない
		STATE_MAX
	};

	CClearRank(int nPriority = 3);
	~CClearRank();

	//=============================
	// オーバーライド関数
	//=============================
	HRESULT Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

	//=============================
	// 静的関数
	//=============================
	static CClearRank* Create(CJudge::JUDGE rank);

private:

	//=============================
	// メンバ関数
	//=============================
	// 状態系

	// その他関数
	void CreateText();	// 文字生成

	//=============================
	// メンバ変数
	//=============================
	// 状態系
	float m_fStateTime;		// 状態カウンター
	State m_state;			// 状態

	// その他
	CJudge::JUDGE m_Rank;	// ランク
	CObject2D* m_pText;		// 文字

};


#endif