//=============================================================================
//
// コマンドヘッダー [command.h]
// Author : Ibuki Okusada
//
//=============================================================================
#ifndef _COMMAND_H_
#define _COMMAND_H_	// 二重インクルード防止

//==========================================================================
// クラス定義
//==========================================================================
// キーコンフィグ
class CCommand
{
public:

	CCommand() {}	// コンストラクタ
	~CCommand() {}	// デストラクタ

	void Uninit();

private:


};

#endif