//=============================================================================
// 
//  葉っぱ処理 [leaf.cpp]
//  Author : 相馬靜雅
// 
//=============================================================================
#include "leaf.h"
#include "manager.h"
#include "calculation.h"
#include "input.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const std::string TEXTURE_SAMPLE = "data\\TEXTURE\\key\\A.png";	// テクスチャのファイル
}

//==========================================================================
// コンストラクタ
//==========================================================================
CLeaf::CLeaf(int nPriority) : CObject3D(nPriority)
{
	// 値のクリア
}

//==========================================================================
// デストラクタ
//==========================================================================
CLeaf::~CLeaf()
{

}

//==========================================================================
// 生成処理
//==========================================================================
CLeaf* CLeaf::Create()
{
	// メモリの確保
	CLeaf* pObj = DEBUG_NEW CLeaf;

	if (pObj != nullptr)
	{
		// 初期化処理
		pObj->Init();
	}

	return pObj;
}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CLeaf::Init()
{

	// オブジェクト3Dの初期化
	CObject3D::Init();

	// テクスチャ設定
	int texID = CTexture::GetInstance()->Regist(TEXTURE_SAMPLE);
	BindTexture(texID);

	// サイズ設定
	D3DXVECTOR2 size = CTexture::GetInstance()->GetImageSize(texID);

	// 縦幅を元にサイズ設定
	size = UtilFunc::Transformation::AdjustSizeByWidth(size, 240.0f);

	MyLib::Vector3 setsize = MyLib::Vector3(size.x, size.y, 0.0f);
	SetSize(setsize);
	SetSizeOrigin(setsize);


	// 位置、向き設定は必要があれば追加

	// 種類の設定
	SetType(CObject::TYPE::TYPE_OBJECT3D);

	return S_OK;
}

//==========================================================================
// 終了処理
//==========================================================================
void CLeaf::Uninit()
{
	// 終了処理
	CObject3D::Uninit();
}

//==========================================================================
// 更新処理
//==========================================================================
void CLeaf::Update()
{
	// 更新処理
	CObject3D::Update();
}

//==========================================================================
// 描画処理
//==========================================================================
void CLeaf::Draw()
{
	// 描画処理
	CObject3D::Draw();
}
