//=============================================================================
// 
//  葉っぱヘッダー [leaf.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _LEAF_H_
#define _LEAF_H_	// 二重インクルード防止

#include "object3D.h"

//==========================================================================
// クラス定義
//==========================================================================
// 葉っぱクラス
class CLeaf : public CObject3D
{
public:

	//=============================
	// 状態列挙
	//=============================
	enum State
	{
		STATE_NONE = 0,		// なにもない
		STATE_MAX
	};

	CLeaf(int nPriority = 7);
	~CLeaf();

	//=============================
	// オーバーライド関数
	//=============================
	HRESULT Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

	//=============================
	// 静的関数
	//=============================
	static CLeaf* Create();

private:

	//=============================
	// メンバ関数
	//=============================
	// 状態系

	// その他関数

	//=============================
	// メンバ変数
	//=============================
	// 状態系
	float m_fStateTime;		// 状態カウンター
	State m_state;			// 状態

	// その他変数

};


#endif