//=============================================================================
// 
//  依頼人セリフエフェクト [serifeffect.cpp]
//  Author : 石原颯馬
// 
//=============================================================================
#include "serifeffect.h"
#include "texture.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const std::string EFFECT_TEXTURE = "data\\TEXTURE\\effect\\voice_effect_00.png";
}

//==========================================================================
// コンストラクタ
//==========================================================================
CSerifEffect::CSerifEffect(int nPriority) : CObject3D(nPriority)
{
	
}

//==========================================================================
// デストラクタ
//==========================================================================
CSerifEffect::~CSerifEffect()
{

}

//==========================================================================
// 生成処理
//==========================================================================
CSerifEffect* CSerifEffect::Create(MyLib::Vector3 pos, MyLib::Vector3 rot, int life)
{
	// メモリの確保
	CSerifEffect* pObject = DEBUG_NEW CSerifEffect;

	if (pObject != nullptr)
	{
		pObject->m_Life = life;
		pObject->SetPosition(pos);
		pObject->SetRotation(rot);

		// 初期化処理
		pObject->Init();
	}

	return pObject;
}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CSerifEffect::Init()
{
	CObject3D::Init();

	SetType(CObject::TYPE::TYPE_OBJECT3D);

	BindTexture(CTexture::GetInstance()->Regist(EFFECT_TEXTURE));
	SetSize(MyLib::Vector3(20.0f,20.0f,0.0f));
	SetVtx();

	return S_OK;
}

//==========================================================================
// 終了処理
//==========================================================================
void CSerifEffect::Uninit()
{
	CObject3D::Uninit();
}

//==========================================================================
// 削除
//==========================================================================
void CSerifEffect::Kill()
{
	
}

//==========================================================================
// 更新処理
//==========================================================================
void CSerifEffect::Update()
{
	m_Life--;
	if (m_Life <= 0)
	{
		Uninit();
		return;
	}

	CObject3D::Update();
}

//==========================================================================
// 描画処理
//==========================================================================
void CSerifEffect::Draw()
{
	CObject3D::Draw();
}
